# Taps
tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/cask-fonts'
tap 'oven-sh/bun'
tap 'riscv/riscv' # For OS course
tap 'amar1729/formulae' # For browserpass extension
tap 'sdkman/tap' # sdkman java version manager

# Formulae
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'ripgrep'
brew 'fzf'
brew 'exa'
brew 'ccat'
brew 'wget'
brew 'pass'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'python@3.8'
brew 'python@3.9'
brew 'python@3.10'
brew 'elm'
brew 'fnm'
brew 'redis'
brew 'yarn'
brew 'bun'
brew 'qemu' # For OS course
brew 'gdb'
brew 'neovim'
brew 'lazygit'
brew 'gnupg'
brew 'browserpass'
brew 'caddy'
brew 'ykman'
brew 'sdkman-cli'
brew 'minikube'
brew 'kubectl'

# Casks
cask 'alfred'
cask 'kitty'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'insomnia'
cask 'readdle-spark'
cask 'slack'
cask 'visual-studio-code'
cask 'zoom'
cask 'vlc'
cask 'spotify'
cask 'netnewswire'
cask 'tikzit'
cask 'todoist'
cask 'intellij-idea'
cask 'rectangle'
cask 'alt-tab'
cask 'gimp'
cask 'messenger'
cask 'obs'
cask 'qlab'
cask 'istat-menus'
cask 'notion'
cask 'microsoft-office'

# Mac App Store
mas 'Notability', id: 360593530
mas 'Yubico Authenticator', id: 1497506650
mas 'Bitwarden', id: 1352778147
mas 'Time Out - Break Reminders', id: 402592703
mas 'Command X', id: 6448461551
