# Taps
tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/cask-fonts'
tap 'oven-sh/bun'
tap 'riscv/riscv' # For OS course

# Formulae
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'ripgrep'
brew 'fzf'
brew 'exa'
brew 'ccat'
brew 'wget'
brew 'pass'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'python@3.8'
brew 'python@3.9'
brew 'python@3.10'
brew 'elm'
brew 'fnm'
brew 'redis'
brew 'yarn'
brew 'bun'
brew 'riscv-tools' # For OS course
brew 'qemu' # For OS course
brew 'gdb'

# Casks
cask 'alfred'
cask 'kitty'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'insomnia'
cask 'readdle-spark'
cask 'slack'
cask 'visual-studio-code'
cask 'zoom'
cask 'vlc'
cask 'spotify'
cask 'netnewswire'
cask 'tikzit'
cask 'utm'
cask 'todoist'

# Mac App Store
mas 'Notability', id: 360593530
mas 'Yubico Authenticator', id: 1497506650
